using LinearAlgebra

# =========================
# Gell-Mann-Matrizen
# =========================

λ0 = Matrix{ComplexF64}(I, 3, 3)

λ1 = [0 1 0;
      1 0 0;
      0 0 0]

λ2 = [0 -im 0;
      im  0 0;
      0   0 0]

λ3 = [1  0  0;
      0 -1  0;
      0  0  0]

λ4 = [0 0 1;
      0 0 0;
      1 0 0]

λ5 = [0 0 -im;
      0 0  0;
      im 0  0]

λ6 = [0 0 0;
      0 0 1;
      0 1 0]

λ7 = [0 0 0;
      0 0 -im;
      0 im 0]

λ8 = (1/sqrt(3)) * [1 0 0;
                    0 1 0;
                    0 0 -2]

omega = [λ0, λ1, λ2, λ3, λ4, λ5, λ6, λ7, λ8]

# =========================
# Basiszustände
# =========================

e1 = [1; 0; 0]
e2 = [0; 1; 0]
e3 = [0; 0; 1]

# =========================
# λ1
# =========================

p1λ1 = (1/sqrt(2)) * [1; 1; 0]
p2λ1 = (1/sqrt(2)) * [1; -1; 0]
p3λ1 = [0; 0; 1]

basisλ1 = [p1λ1, p2λ1, p3λ1]

projλ11 = p1λ1 * p1λ1'
projλ12 = p2λ1 * p2λ1'
projλ13 = p3λ1 * p3λ1'

projλ1 = [projλ11, projλ12, projλ13]

# =========================
# λ2
# =========================

p1λ2 = (1/sqrt(2)) * [1; im; 0]
p2λ2 = (1/sqrt(2)) * [1; -im; 0]
p3λ2 = [0; 0; 1]

basisλ2 = [p1λ2, p2λ2, p3λ2]

projλ21 = p1λ2 * p1λ2'
projλ22 = p2λ2 * p2λ2'
projλ23 = p3λ2 * p3λ2'

projλ2 = [projλ21, projλ22, projλ23]

# =========================
# λ3
# =========================

p1λ3 = [1; 0; 0]
p2λ3 = [0; 1; 0]
p3λ3 = [0; 0; 1]

basisλ3 = [p1λ3, p2λ3, p3λ3]

projλ31 = p1λ3 * p1λ3'
projλ32 = p2λ3 * p2λ3'
projλ33 = p3λ3 * p3λ3'

projλ3 = [projλ31, projλ32, projλ33]

# =========================
# λ4
# =========================

p1λ4 = (1/sqrt(2)) * [1; 0; 1]
p2λ4 = (1/sqrt(2)) * [1; 0; -1]
p3λ4 = [0; 1; 0]

basisλ4 = [p1λ4, p2λ4, p3λ4]

projλ41 = p1λ4 * p1λ4'
projλ42 = p2λ4 * p2λ4'
projλ43 = p3λ4 * p3λ4'

projλ4 = [projλ41, projλ42, projλ43]

# =========================
# λ5
# =========================

p1λ5 = (1/sqrt(2)) * [1; 0; im]
p2λ5 = (1/sqrt(2)) * [1; 0; -im]
p3λ5 = [0; 1; 0]

basisλ5 = [p1λ5, p2λ5, p3λ5]

projλ51 = p1λ5 * p1λ5'
projλ52 = p2λ5 * p2λ5'
projλ53 = p3λ5 * p3λ5'

projλ5 = [projλ51, projλ52, projλ53]

# =========================
# λ6
# =========================

p1λ6 = (1/sqrt(2)) * [0; 1; 1]
p2λ6 = (1/sqrt(2)) * [0; 1; -1]
p3λ6 = [1; 0; 0]

basisλ6 = [p1λ6, p2λ6, p3λ6]

projλ61 = p1λ6 * p1λ6'
projλ62 = p2λ6 * p2λ6'
projλ63 = p3λ6 * p3λ6'

projλ6 = [projλ61, projλ62, projλ63]

# =========================
# λ7
# =========================

p1λ7 = (1/sqrt(2)) * [0; 1; im]
p2λ7 = (1/sqrt(2)) * [0; 1; -im]
p3λ7 = [1; 0; 0]

basisλ7 = [p1λ7, p2λ7, p3λ7]

projλ71 = p1λ7 * p1λ7'
projλ72 = p2λ7 * p2λ7'
projλ73 = p3λ7 * p3λ7'

projλ7 = [projλ71, projλ72, projλ73]

# =========================
# λ8
# =========================

p1λ8 = [1; 0; 0]
p2λ8 = [0; 1; 0]
p3λ8 = [0; 0; 1]

basisλ8 = [p1λ8, p2λ8, p3λ8]

projλ81 = p1λ8 * p1λ8'
projλ82 = p2λ8 * p2λ8'
projλ83 = p3λ8 * p3λ8'

projλ8 = [projλ81, projλ82, projλ83]

# =========================
# Sammlungen
# =========================

basisAlle = [
    basisλ1,
    basisλ2,
    basisλ3,
    basisλ4,
    basisλ5,
    basisλ6,
    basisλ7,
    basisλ8
]

projektorenBasis = [
    projλ1,
    projλ2,
    projλ3,
    projλ4,
    projλ5,
    projλ6,
    projλ7,
    projλ8
]

function tensorBasis(basisA, basisB)

    tensorVecs = []

    for v in basisA
        for w in basisB
            push!(tensorVecs, kron(v, w))
        end
    end

    return tensorVecs
end

lambda12=tensorBasis(basisλ1,basisλ5)

println(lambda12)